Revit 2024 API
SpatialFieldManager.LegendShowDescription Property
 If true legend contains analysis description.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool LegendShowDescription { get; set; }
Visual Basic
Public Property LegendShowDescription As Boolean
	Get
	Set
Visual C++
public:
property bool LegendShowDescription {
	bool get ();
	void set (bool value);
}
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace